# Install fonts
cask "font-caskaydia-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-ubuntu-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-monaspice-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-cascadia-code-nf"
cask "font-intel-one-mono"
cask "font-inter"
cask "font-jetbrains-mono-nerd-font"

# Install AI tools
brew "aichat"
brew "block-goose-cli"
tap "gptscript-ai/tap"
brew "gptscript-ai/tap/clio"
tap "charmbracelet/tap"
brew "charmbracelet/tap/crush"
cask "codex"
brew "gemini-cli"
brew "llm"
brew "mods"
brew "opencode"
brew "qwen-code"
brew "whisper-cpp"
brew "ramalama"

# Install cli stuff
tap "valkyrie00/bbrew"
brew "atuin"
brew "bat"
brew "bash-preexec"
brew "valkyrie00/bbrew/bbrew"
brew "carapace"
brew "chezmoi"
brew "direnv"
brew "dysk"
brew "eza"
brew "fd"
brew "gh"
brew "glab"
brew "rg"
brew "starship"
brew "shellcheck"
brew "stress-ng"
brew "tealdeer"
brew "trash-cli"
brew "television"
brew "uutils-coreutils"
brew "ugrep"
brew "yq"
brew "zoxide"
